# day 111 and day 112 and day 113

In [1]:
import pandas as pd

# series

In [1]:
import pandas as pd

Series = pd.Series(['Mango','Mouse','Rattatouville','Amudhakanni'])

Series

0            Mango
1            Mouse
2    Rattatouville
3      Amudhakanni
dtype: object

In [2]:
Rate = pd.Series([100,0.1,420,1500])

Rate

0     100.0
1       0.1
2     420.0
3    1500.0
dtype: float64

# DataFrame

In [4]:
fruit_price = pd.DataFrame({'Fruits':Series, 'Rate':Rate})
fruit_price

          Fruits    Rate
0          Mango   100.0
1          Mouse     0.1
2  Rattatouville   420.0
3    Amudhakanni  1500.0

In [2]:
car_sales = pd.read_csv('car-sales.csv')
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [6]:
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     object
dtypes: int64(2), object(3)
memory usage: 528.0+ bytes

In [7]:
car_sales.describe()

       Odometer (KM)      Doors
count      10.000000  10.000000
mean    78601.400000   4.000000
std     61983.471735   0.471405
min     11179.000000   3.000000
25%     35836.250000   4.000000
50%     57369.000000   4.000000
75%     96384.500000   4.000000
max    213095.000000   5.000000

# exporting a DataFrame after making changes

In [8]:
car_sales.to_csv('exported-car-sales.csv')

In [9]:
exported_car_sales = pd.read_csv('exported-car-sales.csv')
exported_car_sales.head(5)

   Unnamed: 0    Make Colour  Odometer (KM)  Doors       Price
0           0  Toyota  White         150043      4   $4,000.00
1           1   Honda    Red          87899      4   $5,000.00
2           2  Toyota   Blue          32549      3   $7,000.00
3           3     BMW  Black          11179      5  $22,000.00
4           4  Nissan  White         213095      4   $3,500.00

In [14]:
exported_car_sales = exported_car_sales.drop('Unnamed: 0',axis=1)

exported_car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

# importing a file using a URL or link

In [15]:
heart_disease = pd.read_csv("https://raw.githubusercontent.com/mrdbourke/zero-to-mastery-ml/master/data/heart-disease.csv")

heart_disease

,age,sex,cp,trestbps,chol,fbs,restecg,thalach,exang,oldpeak,slope,ca,thal,target
0,63,1,3,145,233,1,0,150,0,2.3,0,0,1,1
1,37,1,2,130,250,0,1,187,0,3.5,0,0,2,1
2,41,0,1,130,204,0,0,172,0,1.4,2,0,2,1
3,56,1,1,120,236,0,1,178,0,0.8,2,0,2,1
4,57,0,0,120,354,0,1,163,1,0.6,2,0,2,1
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
298,57,0,0,140,241,0,1,123,1,0.2,1,0,3,0
299,45,1,3,110,264,0,1,132,0,1.2,1,0,3,0
300,68,1,0,144,193,1,1,141,0,3.4,1,2,3,0
301,57,1,0,130,131,0,1,115,1,1.2,1,1,3,0
302,57,0,1,130,236,0,0,174,0,0.0,1,1,2,0

In [5]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [6]:
car_sales.loc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

In [7]:
car_sales.iloc[3]

Make                    BMW
Colour                Black
Odometer (KM)         11179
Doors                     5
Price            $22,000.00
Name: 3, dtype: object

In [12]:
animals = pd.Series(['cat','dog','komado Dragon','snake','king-kong'],index=[3,8,9,2,5])

animals

3              cat
8              dog
9    komado Dragon
2            snake
5        king-kong
dtype: object

In [13]:
animals.loc[3] # refers to name of the index

'cat'

In [14]:
animals.iloc[3] # refers to the position of the index

'snake'

In [17]:
animals.iloc[:4]

3              cat
8              dog
9    komado Dragon
2            snake
dtype: object

# groupby with booleans

In [26]:
car_sales

     Make Colour  Odometer (KM)  Doors       Price
0  Toyota  White         150043      4   $4,000.00
1   Honda    Red          87899      4   $5,000.00
2  Toyota   Blue          32549      3   $7,000.00
3     BMW  Black          11179      5  $22,000.00
4  Nissan  White         213095      4   $3,500.00
5  Toyota  Green          99213      4   $4,500.00
6   Honda   Blue          45698      4   $7,500.00
7   Honda   Blue          54738      4   $7,000.00
8  Toyota  White          60000      4   $6,250.00
9  Nissan  White          31600      4   $9,700.00

In [24]:
boolean = (car_sales['Make'] == 'Toyota') & (car_sales['Colour'] == 'White')

car_sales[boolean].groupby('Make').mean()

        Odometer (KM)  Doors
Make
Toyota       105021.5    4.0

In [25]:
car_sales[boolean]

     Make Colour  Odometer (KM)  Doors      Price
0  Toyota  White         150043      4  $4,000.00
8  Toyota  White          60000      4  $6,250.00

# replacing $ in price with nothing and converting it into int

In [38]:
car_sales['Price'] = car_sales['Price'].str.replace('[$,.]','').astype(float)/100

car_sales

C:\Users\ADMIN\AppData\Local\Temp\ipykernel_11440\2915443451.py:1: FutureWarning: The default value of regex will change from True to False in a future version.
  car_sales['Price'] = car_sales['Price'].str.replace('[$,.]','').astype(float)/100

     Make Colour  Odometer (KM)  Doors    Price
0  Toyota  White         150043      4   4000.0
1   Honda    Red          87899      4   5000.0
2  Toyota   Blue          32549      3   7000.0
3     BMW  Black          11179      5  22000.0
4  Nissan  White         213095      4   3500.0
5  Toyota  Green          99213      4   4500.0
6   Honda   Blue          45698      4   7500.0
7   Honda   Blue          54738      4   7000.0
8  Toyota  White          60000      4   6250.0
9  Nissan  White          31600      4   9700.0

In [41]:
car_sales.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 10 entries, 0 to 9
Data columns (total 5 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Make           10 non-null     object
 1   Colour         10 non-null     object
 2   Odometer (KM)  10 non-null     int64
 3   Doors          10 non-null     int64
 4   Price          10 non-null     float64
dtypes: float64(1), int64(2), object(2)
memory usage: 528.0+ bytes

In [40]:
car_sales.describe()

       Odometer (KM)      Doors         Price
count      10.000000  10.000000     10.000000
mean    78601.400000   4.000000   7645.000000
std     61983.471735   0.471405   5379.407753
min     11179.000000   3.000000   3500.000000
25%     35836.250000   4.000000   4625.000000
50%     57369.000000   4.000000   6625.000000
75%     96384.500000   4.000000   7375.000000
max    213095.000000   5.000000  22000.000000

# dealing with missing data

In [42]:
df = pd.read_csv('car-sales-missing-data.csv')
df

     Make Colour  Odometer  Doors    Price
0  Toyota  White  150043.0    4.0   $4,000
1   Honda    Red   87899.0    4.0   $5,000
2  Toyota   Blue       NaN    3.0   $7,000
3     BMW  Black   11179.0    5.0  $22,000
4  Nissan  White  213095.0    4.0   $3,500
5  Toyota  Green       NaN    4.0   $4,500
6   Honda    NaN       NaN    4.0   $7,500
7   Honda   Blue       NaN    4.0      NaN
8  Toyota  White   60000.0    NaN      NaN
9     NaN  White   31600.0    4.0   $9,700

# shuffling the data

In [7]:
car_sales_shuffled = car_sales.sample(frac=1)

car_sales_shuffled

     Make Colour  Odometer (KM)  Doors       Price
9  Nissan  White          31600      4   $9,700.00
8  Toyota  White          60000      4   $6,250.00
1   Honda    Red          87899      4   $5,000.00
5  Toyota  Green          99213      4   $4,500.00
3     BMW  Black          11179      5  $22,000.00
0  Toyota  White         150043      4   $4,000.00
7   Honda   Blue          54738      4   $7,000.00
6   Honda   Blue          45698      4   $7,500.00
4  Nissan  White         213095      4   $3,500.00
2  Toyota   Blue          32549      3   $7,000.00

# resetting the shuffled_index

In [6]:
car_sales_shuffled = car_sales_shuffled.reset_index()

car_sales_shuffled

   index    Make Colour  Odometer (KM)  Doors       Price
0      2  Toyota   Blue          32549      3   $7,000.00
1      4  Nissan  White         213095      4   $3,500.00
2      8  Toyota  White          60000      4   $6,250.00
3      0  Toyota  White         150043      4   $4,000.00
4      3     BMW  Black          11179      5  $22,000.00
5      9  Nissan  White          31600      4   $9,700.00
6      1   Honda    Red          87899      4   $5,000.00
7      6   Honda   Blue          45698      4   $7,500.00
8      7   Honda   Blue          54738      4   $7,000.00
9      5  Toyota  Green          99213      4   $4,500.00

In [8]:
car_sales_shuffled = car_sales_shuffled.reset_index(drop=True) # drops the index

car_sales_shuffled

     Make Colour  Odometer (KM)  Doors       Price
0  Nissan  White          31600      4   $9,700.00
1  Toyota  White          60000      4   $6,250.00
2   Honda    Red          87899      4   $5,000.00
3  Toyota  Green          99213      4   $4,500.00
4     BMW  Black          11179      5  $22,000.00
5  Toyota  White         150043      4   $4,000.00
6   Honda   Blue          54738      4   $7,000.00
7   Honda   Blue          45698      4   $7,500.00
8  Nissan  White         213095      4   $3,500.00
9  Toyota   Blue          32549      3   $7,000.00